<#import "parts/common.ftl" as c>
<@c.page>

<pre>
    Первоочередные:
    1) Добавление платных опций.
    2) Страница приветсвия
    3) Переход на Rest
    5) Сделать Error page

    После REST
    2) Ошибка при логине
    3) Нормальная регистрация

    Баги
    1) Не добавлять пустую картинку при редактировании отеля
    6) перевод на русский
    7) Исправить отображение collapse для последнего элемента
    10) проверка на отсутвие roomTypes
    11) При удалении картинки удалять ее и на диске, а не только ее путь из базы данных
    12) Обработка ошибок при редактировании информации отеля

    Фитчи (второстепенные)
    10) Строки в формах на roomSettings page
    4) Свой профиль (страницы паспорта и своё фото по желанию)
    5) Шрифты на общем положении
    4) Перейти на lombok
    6) навигация по центру и с анимацией

    </pre>
    </@c.page>
