<#import "general_blocks/common.ftl" as c>
<@c.page>

    <pre>
    Первоочередные:
    2) Страница приветсвия
    3) Переход на Rest
    5) Доделать картинку у roomType
    6) Переделать Js framework под offline использование

    После REST
    2) Ошибка при логине

    Баги
    1) Не добавлять пустую картинку при редактировании отеля
    7) Исправить отображение collapse для последнего элемента
    10) проверка на отсутвие roomTypes
    11) При удалении картинки удалять ее и на диске, а не только ее путь из базы данных
    12) Обработка ошибок при редактировании информации отеля

    Фитчи (второстепенные)
    10) Строки в формах на roomSettings page
    4) Свой профиль (страницы паспорта и своё фото по желанию)
    7)рассылка почты юзерам
    </pre>

1) Участие в performance review кода
2) Рефакторинг какого нибудь неоптимального кода
3) Интеграция со сторонними сервисами (твитер, гугл и тп)
4) Опыт в выборе решения основываясь на предворительном анализе
5) Многопоточность (Ну уж если получится)

</@c.page>
